---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarBendData.BarNominalDiameter
source: html/4af85f50-5725-36fb-dedc-972639ed4c5c.htm
---
# Autodesk.Revit.DB.Structure.RebarBendData.BarNominalDiameter Property

Defines the nominal diameter of the bar.

## Syntax (C#)
```csharp
public double BarNominalDiameter { get; set; }
```